app/controllers/sessions_controller.rb

	def create
		#i took a [:session] out of the below two lines in refactoring
		user = User.find_by_email(params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'jesse.pinkman@gmail.com' LIMIT 1